//: ## 协议(Protocols)
//: - 1 协议的语法
//: - 2 属性要求
//: - 3 方法要求
//: - 4 异变方法要求
//: - 5 初始化器要求
//: - 5.1 协议初始化器要求的类实现
//: - 5.2 可失败初始化器要求
//: - 6 将协议作为类型
//: - 7 委托
//: - 8 在扩展里添加协议遵循
//: - 8.1 使用扩展声明采纳协议
//: - 9 协议类型的集合
//: - 10 协议继承
//: - 11 类专用的协议
//: - 12 协议组合
//: - 13 协议遵循的检查
//: - 14 可选协议要求
//: - 15 协议扩展
//: - 15.1 提供默认实现
//: - 15.2 给协议扩展添加限制

//: 协议为方法、属性、以及其他特定的任务需求或功能定义蓝图。协议可被类、结构体、或枚举类型采纳以提供所需功能的具体实现。满足了协议中需求的任意类型都叫做遵循了该协议。

//: 除了指定遵循类型必须实现的要求外，你可以扩展一个协议以实现其中的一些需求或实现一个符合类型的可以利用的附加功能。

//: [上一页](@previous) | [下一页](@next)
